Repository: Jerry-VW/scsvlog
Catalog: repo/locale/*/LC_MESSAGES/default.po
Languages: ru, uk

source: Save as PNG...
ru: Записать в PNG...
uk: Записати в PNG

source: Replace ?
ru: Заменить ?
uk: Замінити ?

source: Confirm replace
ru: Подтвердите замену
uk: Підтвердіть заміну

source: Standard color
ru: Стандартный цвет
uk: Стандартний колір

source: Save CSV...
ru: Записать CSV...
uk: Записати CSV...

source: Load CSV...
ru: Прочитать CSV...
uk: Прочитати CSV...

source: port
ru: порт
uk: порт

source: Show port configuration
ru: Настройки порта
uk: Налаштування порта

source: config
ru: настройка
uk: конфіг

source: Show chart/channels configuration
ru: Настройки графика/каналов
uk: Налаштування графіка/каналів

source: values
ru: значения
uk: значення

source: Show values
ru: Показать значения
uk: Показати значення

source: chart
ru: график
uk: графік

source: Enable chart
ru: Включить запись графика
uk: Запис графіка

source: reset
ru: сброс
uk: скид

source: Clear all data
ru: Очистить все данные
uk: Очистити всі дані

source: Save chart to PNG
ru: Записать график в PNG
uk: Записати графік в PNG

source: Save data to CSV
ru: Записать данные в CSV
uk: Записати дані в CSV

source: Load data from CSV
ru: Прочитать данные из CSV
uk: Прочитати дані з CSV

source: Select current Look&Feel
ru: Выбрать текущий вид
uk: Вибрати вигляд

source: Select current language
ru: Выбрать текущий язык
uk: Вибрати мову

source: server
ru: сервер
uk: сервер

source: Enable server
ru: Включить сервер
uk: Увімкнути сервер

source: Server port
ru: Порт сервера
uk: Порт сервера

source: connect
ru: подключить
uk: підключення

source: Connect to port
ru: Подключиться к порту
uk: Підключитись до порта

source: disconnect
ru: отключить
uk: відключення

source: Disconnect from port
ru: Отключить порт
uk: Відключитись від порта

source: Port
ru: Порт
uk: Порт

source: Select channel
ru: Выбрать канал
uk: Вибрати канал

source: Socket IP address and port
ru: Выбрать IP адрес и порт
uk: IP адреса і порт

source: baud:
ru: скорость:
uk: швидкість:

source: Serial port baud rate
ru: Скорость посл.порта
uk: Швидкість посл.порта

source: bits:
ru: биты:
uk: біти:

source: Serial port data bits
ru: Биты данных посл.порта
uk: Біти даних посл.порта

source: parity:
ru: парность:
uk: парність:

source: Serial port parity
ru: Парность посл.порта
uk: Парність посл.порта

source: stops:
ru: стопы:
uk: стопи:

source: Serial port stop bits
ru: Стоп-биты посл.порта
uk: Стоп-біти посл.порта

source: X axis label
ru: Метка по оси X
uk: Мітка по осі X

source: line №
ru: № строки
uk: № стрічки

source: 1st col
ru: 1ая колонка
uk: 1ша колонка

source: date
ru: дата
uk: дата

source: X axis type
ru: Тип оси Х
uk: Тип осі X

source: <html>X axis date/time format:<br><b>y</b> - year, <b>M</b> - month, <b>d</b> - date;<br><b>H</b> - hour, <b>m</b> - minute, <b>s</b> - second;<br><b>'single quotes'</b> - plain text.</html>
ru: <html>формат даты/времени по оси X:<br><b>y</b> - год, <b>M</b> - месяц, <b>d</b> - дата;<br><b>H</b> - часы, <b>m</b> - минуты, <b>s</b> - секунды;<br><b>'одинарные кавычки'</b> - любой текст.</html>
uk: <html>Формат дати/часу по осі X:<br><b>y</b> - рік, <b>M</b> - місяць, <b>d</b> - дата;<br><b>H</b> - година, <b>m</b> - хвилина, <b>s</b> - секунда;<br><b>'одинарні лапки'</b> - звичайний текст.</html>

source: limit:
ru: лимит:
uk: ліміт:

source: Limit number of points
ru: Ограничить количество точек
uk: Обмежити кількість точок

source: skip:
ru: пропуск:
uk: пропуск:

source: Skip CSV lines
ru: Пропуск строк
uk: Пропуск стрічок CSV

source: Y axis label
ru: Метка по оси Y
uk: Мітка по осі Y

source: window
ru: окно
uk: вікно

source: X window minimum
ru: Минимум окна по оси X
uk: Мінімум вікна по осі X

source: X window maximum
ru: Максимум окна по оси X
uk: Максимум вікна по осі X

source: Y window minimum
ru: Минимум окна по оси Y
uk: Мінімум вікна по осі Y

source: Y window maximum
ru: Максимум окна по оси Y
uk: Максимум вікна по осі Y

source: grid:
ru: сетка:
uk: сітка:

source: Enable X grid
ru: Сетка по оси X
uk: Сітка по осі Х

source: Enable Y grid
ru: Сетка по оси Y
uk: Сітка по осі Y

source: show
ru: видимость
uk: видимість

source: Trace visibility
ru: Видимость линии
uk: Видимість лінії

source: visibility of trace №%d
ru: видимость графика №%d
uk: видимість графіка №%d

source: name
ru: имя
uk: ім"я

source: Trace name
ru: Имя линии
uk: Назва лінії

source: name of trace №%d
ru: имя графика №%d
uk: ім'я графіка №%d

source: Y axis
ru: ось Y
uk: вісь Y

source: Number of Y axis
ru: Номер шкалы Y
uk: Номер шкали Y

source: axis of trace №%d
ru: ось графика №%d
uk: вісь графіка №%d

source: color
ru: цвет
uk: колір

source: Trace color
ru: Цвет линии
uk: Колір лінії

source: color of trace №%d
ru: цвет графика №%d
uk: колір графіка №%d

source: width
ru: толщина
uk: товщина

source: Trace width
ru: Толщина линии
uk: Товщина лінії

source: width of trace №%d
ru: толщина графика №%d
uk: товщина графіка №%d

source: style
ru: стиль
uk: стиль

source: Trace style
ru: Стиль линии
uk: Стиль лінії

source: style of trace №%d
ru: стиль графика №%d
uk: стиль графіка №%d

source: Value correction
ru: Коррекция значения
uk: Корекція значення

source: delta of value №%d
ru: коррекция значения №%d
uk: корекція значення №%d

source: Config
ru: Настройки
uk: Конфіг

source: value №%d
ru: значение №%d
uk: значення №%d
